# 运算符
# 1.算术操作符：(+ - * / % **(幂，次方) //(地板除法，舍弃小数))
print("3 + 7 = %d" % (3 + 7))   # 输出结果： 3 + 7 = 10
print("3 - 7 = %d" % (3 - 7))   # 输出结果： 3 - 7 = -4
print("3 * 7 = %d" % (3 * 7))   # 输出结果： 3 * 7 = 21
print("7 / 3 = %f" % (7 / 3))   # 输出结果： 7 / 3 = 2.333333
print("7 %% 3 = %d" % (7 % 3))  # 输出结果： 7 % 3 = 1 - 幂
print("3 ** 6 = %d" % (7 ** 3)) # 输出结果： 3 ** 6 = 343 - 次方
print("3 // 6 = %f" % (7 // 3)) # 输出结果： 3 // 6 = 2.000000 - 地板除法，舍弃小数

# 2.比较运算符：(== != > < >= <=)

# 3.赋值运算符：(== += -= *= /= %= **= //=)

# 4.位运算符：(&(按位与) |(按位或) ^(异或，不同为1) ~(取反) << >>)

# 5.逻辑运算符：(and or not)

# 6.成员运算符：(in not in)

# 7.身份运算符(判断是否引用同一个对象)：(is is not)

# 8.运算符优先级：
# **(指数)   >   ~ + -(取反，正负号)   >   * / % //(乘除，求余，地板除)   >   << >>(左右移)
# >    &(按位与)   >  ^ |(异或，按位或)  >   < <= > >=(比较运算符)   >  等于运算符  >   赋值运算符
# >  身份运算符  >  成员运算符  >  逻辑运算符